hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_lobs_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_LOBS_H
#define HPM_LOBS_H

typedef struct {
    __RW uint32_t CTRL;                        /* 0x0: Control Register */
    __RW uint32_t IRQ_EN;                      /* 0x4: Interrupt Enable Register */
    __RW uint32_t IRQ_STS;                     /* 0x8: Interrupt Status Register */
    __RW uint32_t STREAMCTRL;                  /* 0xC: Stream Control Register */
    __RW uint32_t PTACTION;                    /* 0x10: Pre-trigger Action Register */
    __RW uint32_t STARTADDR;                   /* 0x14: Start Address Register */
    __RW uint32_t ENDADDR;                     /* 0x18: End Address Register */
    __R  uint8_t  RESERVED0[4];                /* 0x1C - 0x1F: Reserved */
    __R  uint32_t CTSR;                        /* 0x20: Current Trigger State Register */
    __R  uint32_t CCVR;                        /* 0x24: Current Counter Value Register */
    __R  uint32_t CAVR;                        /* 0x28: Current Action Value Register */
    __R  uint8_t  RESERVED1[4];                /* 0x2C - 0x2F: Reserved */
    __R  uint32_t FIFOSTATE;                   /* 0x30: Fifo State Register */
    __RW uint32_t FINALADDR;                   /* 0x34: Final Address Register */
    __R  uint8_t  RESERVED2[8];                /* 0x38 - 0x3F: Reserved */
    __RW uint32_t TRIGADDR1;                   /* 0x40: Trigger Address1 */
    __RW uint32_t TRIGADDR2;                   /* 0x44: Trigger Address1 */
    __RW uint32_t TRIGADDR3;                   /* 0x48: Trigger Address1 */
    __RW uint32_t TRIGADDR4;                   /* 0x4C: Trigger Address1 */
    __RW uint32_t GRPSELA;                     /* 0x50: Group Select Register */
    __RW uint32_t GRPENA;                      /* 0x54: Group Enable Register */
    __RW uint32_t SIGSELA1;                    /* 0x58: Signal Select1 Register */
    __R  uint8_t  RESERVED3[4];                /* 0x5C - 0x5F: Reserved */
    __RW uint32_t SIGSELA2;                    /* 0x60: Signal Select2 Register */
    __R  uint8_t  RESERVED4[52];               /* 0x64 - 0x97: Reserved */
    __RW uint32_t SIGENA;                      /* 0x98: Signal Enable Register */
    __R  uint8_t  RESERVED5[100];              /* 0x9C - 0xFF: Reserved */
    struct {
        __RW uint32_t SIGSEL;                  /* 0x100: Signal Select Register */
        __RW uint32_t TRIGCTRL;                /* 0x104: Trigger Control Register */
        __RW uint32_t NEXTSTATE;               /* 0x108: Next State Register */
        __RW uint32_t ACTION;                  /* 0x10C: Action Register */
        __R  uint8_t  RESERVED0[16];           /* 0x110 - 0x11F: Reserved */
        __RW uint32_t COUNTCOMP;               /* 0x120: Counter Compare Register */
        __R  uint8_t  RESERVED1[12];           /* 0x124 - 0x12F: Reserved */
        __RW uint32_t EXTMASK;                 /* 0x130: External Mask Register */
        __RW uint32_t EXTCOMP;                 /* 0x134: External Compare Register */
        __R  uint8_t  RESERVED2[8];            /* 0x138 - 0x13F: Reserved */
        __RW uint32_t SIGMASK;                 /* 0x140: Signal Mask Register */
        __RW uint32_t COMPEN;                  /* 0x144: Compare Enable register */
        __R  uint8_t  RESERVED3[56];           /* 0x148 - 0x17F: Reserved */
        __RW uint32_t SIGCOMP0;                /* 0x180: Signal Compare Register0 */
        __RW uint32_t SIGCOMP1;                /* 0x184: Signal Compare Register1 */
        __RW uint32_t SIGCOMP2;                /* 0x188: Signal Compare Register2 */
        __RW uint32_t SIGCOMP3;                /* 0x18C: Signal Compare Register3 */
        __R  uint8_t  RESERVED4[112];          /* 0x190 - 0x1FF: Reserved */
    } STATE[5];
    __R  uint8_t  RESERVED6[2480];             /* 0x600 - 0xFAF: Reserved */
    __RW uint32_t LAR;                         /* 0xFB0: Lock Access Register */
} LOBS_Type;


/* Bitfield definition for register: CTRL */
/*
 * RUN (RW)
 *
 * Run control.
 * 0 LOBS disabled. Register programming permitted.
 * 1 LOBS enabled
 */
#define LOBS_CTRL_RUN_MASK (0x1U)
#define LOBS_CTRL_RUN_SHIFT (0U)
#define LOBS_CTRL_RUN_SET(x) (((uint32_t)(x) << LOBS_CTRL_RUN_SHIFT) & LOBS_CTRL_RUN_MASK)
#define LOBS_CTRL_RUN_GET(x) (((uint32_t)(x) & LOBS_CTRL_RUN_MASK) >> LOBS_CTRL_RUN_SHIFT)

/* Bitfield definition for register: IRQ_EN */
/*
 * FULL_EN (RW)
 *
 * FIFO overflow status interrupt enable
 */
#define LOBS_IRQ_EN_FULL_EN_MASK (0x2U)
#define LOBS_IRQ_EN_FULL_EN_SHIFT (1U)
#define LOBS_IRQ_EN_FULL_EN_SET(x) (((uint32_t)(x) << LOBS_IRQ_EN_FULL_EN_SHIFT) & LOBS_IRQ_EN_FULL_EN_MASK)
#define LOBS_IRQ_EN_FULL_EN_GET(x) (((uint32_t)(x) & LOBS_IRQ_EN_FULL_EN_MASK) >> LOBS_IRQ_EN_FULL_EN_SHIFT)

/*
 * FINAL_EN (RW)
 *
 * final status interrupt enable
 */
#define LOBS_IRQ_EN_FINAL_EN_MASK (0x1U)
#define LOBS_IRQ_EN_FINAL_EN_SHIFT (0U)
#define LOBS_IRQ_EN_FINAL_EN_SET(x) (((uint32_t)(x) << LOBS_IRQ_EN_FINAL_EN_SHIFT) & LOBS_IRQ_EN_FINAL_EN_MASK)
#define LOBS_IRQ_EN_FINAL_EN_GET(x) (((uint32_t)(x) & LOBS_IRQ_EN_FINAL_EN_MASK) >> LOBS_IRQ_EN_FINAL_EN_SHIFT)

/* Bitfield definition for register: IRQ_STS */
/*
 * FULL_STS (W1C)
 *
 * FIFO overflow status interrupt status
 */
#define LOBS_IRQ_STS_FULL_STS_MASK (0x2U)
#define LOBS_IRQ_STS_FULL_STS_SHIFT (1U)
#define LOBS_IRQ_STS_FULL_STS_SET(x) (((uint32_t)(x) << LOBS_IRQ_STS_FULL_STS_SHIFT) & LOBS_IRQ_STS_FULL_STS_MASK)
#define LOBS_IRQ_STS_FULL_STS_GET(x) (((uint32_t)(x) & LOBS_IRQ_STS_FULL_STS_MASK) >> LOBS_IRQ_STS_FULL_STS_SHIFT)

/*
 * FINAL_STS (W1C)
 *
 * final status interrupt status
 */
#define LOBS_IRQ_STS_FINAL_STS_MASK (0x1U)
#define LOBS_IRQ_STS_FINAL_STS_SHIFT (0U)
#define LOBS_IRQ_STS_FINAL_STS_SET(x) (((uint32_t)(x) << LOBS_IRQ_STS_FINAL_STS_SHIFT) & LOBS_IRQ_STS_FINAL_STS_MASK)
#define LOBS_IRQ_STS_FINAL_STS_GET(x) (((uint32_t)(x) & LOBS_IRQ_STS_FINAL_STS_MASK) >> LOBS_IRQ_STS_FINAL_STS_SHIFT)

/* Bitfield definition for register: STREAMCTRL */
/*
 * SAMPLE_INCR (RW)
 *
 * Sample Rate high extension bits, the high 6 bits of the SAMPLE bit field, and the combined value with the SAMPLE bit field are as follows:
 * 4 take one every 5
 * 5 take one every 6
 * 6 take one every 7
 * 9 take one every 10
 * 49 take one every 50
 * 99 take one every 100
 * 499 take one every 500
 * 999 take one every 1000
 * others not supported
 */
#define LOBS_STREAMCTRL_SAMPLE_INCR_MASK (0x7E00U)
#define LOBS_STREAMCTRL_SAMPLE_INCR_SHIFT (9U)
#define LOBS_STREAMCTRL_SAMPLE_INCR_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_SAMPLE_INCR_SHIFT) & LOBS_STREAMCTRL_SAMPLE_INCR_MASK)
#define LOBS_STREAMCTRL_SAMPLE_INCR_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_SAMPLE_INCR_MASK) >> LOBS_STREAMCTRL_SAMPLE_INCR_SHIFT)

