hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_lobs_regs.h
/*
 * SEL (RW)
 *
 * Signal Group Select
 * 0 128bit from one group
 * 1 from 2 groups, 4bit in each group
 */
#define LOBS_STREAMCTRL_SEL_MASK (0x100U)
#define LOBS_STREAMCTRL_SEL_SHIFT (8U)
#define LOBS_STREAMCTRL_SEL_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_SEL_SHIFT) & LOBS_STREAMCTRL_SEL_MASK)
#define LOBS_STREAMCTRL_SEL_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_SEL_MASK) >> LOBS_STREAMCTRL_SEL_SHIFT)

/*
 * SAMPLE (RW)
 *
 * Sample Rate
 * 4 take one every 5
 * 5 take one every 6
 * 6 take one every 7
 */
#define LOBS_STREAMCTRL_SAMPLE_MASK (0x78U)
#define LOBS_STREAMCTRL_SAMPLE_SHIFT (3U)
#define LOBS_STREAMCTRL_SAMPLE_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_SAMPLE_SHIFT) & LOBS_STREAMCTRL_SAMPLE_MASK)
#define LOBS_STREAMCTRL_SAMPLE_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_SAMPLE_MASK) >> LOBS_STREAMCTRL_SAMPLE_SHIFT)

/*
 * BURST (RW)
 *
 * Burst Cfg
 * 3b011 Incr4
 * 3b101 Incr8
 * 3b111 Incr16
 */
#define LOBS_STREAMCTRL_BURST_MASK (0x7U)
#define LOBS_STREAMCTRL_BURST_SHIFT (0U)
#define LOBS_STREAMCTRL_BURST_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_BURST_SHIFT) & LOBS_STREAMCTRL_BURST_MASK)
#define LOBS_STREAMCTRL_BURST_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_BURST_MASK) >> LOBS_STREAMCTRL_BURST_SHIFT)

/* Bitfield definition for register: PTACTION */
/*
 * TRACE (RW)
 *
 * Enables trace
 */
#define LOBS_PTACTION_TRACE_MASK (0x8U)
#define LOBS_PTACTION_TRACE_SHIFT (3U)
#define LOBS_PTACTION_TRACE_SET(x) (((uint32_t)(x) << LOBS_PTACTION_TRACE_SHIFT) & LOBS_PTACTION_TRACE_MASK)
#define LOBS_PTACTION_TRACE_GET(x) (((uint32_t)(x) & LOBS_PTACTION_TRACE_MASK) >> LOBS_PTACTION_TRACE_SHIFT)

/* Bitfield definition for register: STARTADDR */
/*
 * ADDR (RW)
 *
 * Start address
 */
#define LOBS_STARTADDR_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_STARTADDR_ADDR_SHIFT (0U)
#define LOBS_STARTADDR_ADDR_SET(x) (((uint32_t)(x) << LOBS_STARTADDR_ADDR_SHIFT) & LOBS_STARTADDR_ADDR_MASK)
#define LOBS_STARTADDR_ADDR_GET(x) (((uint32_t)(x) & LOBS_STARTADDR_ADDR_MASK) >> LOBS_STARTADDR_ADDR_SHIFT)

/* Bitfield definition for register: ENDADDR */
/*
 * ADDR (RW)
 *
 * End address
 */
#define LOBS_ENDADDR_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_ENDADDR_ADDR_SHIFT (0U)
#define LOBS_ENDADDR_ADDR_SET(x) (((uint32_t)(x) << LOBS_ENDADDR_ADDR_SHIFT) & LOBS_ENDADDR_ADDR_MASK)
#define LOBS_ENDADDR_ADDR_GET(x) (((uint32_t)(x) & LOBS_ENDADDR_ADDR_MASK) >> LOBS_ENDADDR_ADDR_SHIFT)

/* Bitfield definition for register: CTSR */
/*
 * FINALSTATE (RO)
 *
 * 0 LOBS is still tracing.
 * 1 Indicates that the LOBS has stopped advancing Trigger States and stopped trace.
 * FINALSTATE can be set by TRIGCTRL.COUNTBRK reaching the final loop count, or by programming NEXTSTATEto zero
 */
#define LOBS_CTSR_FINALSTATE_MASK (0x80000000UL)
#define LOBS_CTSR_FINALSTATE_SHIFT (31U)
#define LOBS_CTSR_FINALSTATE_GET(x) (((uint32_t)(x) & LOBS_CTSR_FINALSTATE_MASK) >> LOBS_CTSR_FINALSTATE_SHIFT)

/*
 * CTSR (RO)
 *
 * Reads current Trigger State. This is a one-hot encoded field.
 * When CTRL.RUN:
 * 0 RAZ.
 * 1 Returns current Trigger State.
 * If FINALSTATE is 1, then the CTSR field gives the Trigger State when FINALSTATE became 1
 */
#define LOBS_CTSR_CTSR_MASK (0x1FU)
#define LOBS_CTSR_CTSR_SHIFT (0U)
#define LOBS_CTSR_CTSR_GET(x) (((uint32_t)(x) & LOBS_CTSR_CTSR_MASK) >> LOBS_CTSR_CTSR_SHIFT)

/* Bitfield definition for register: CCVR */
/*
 * CCVR (RO)
 *
 * Returns the counter value when the CTSR was last read. If the CTSR has never been read, then the value in the CCVR is undefined
 */
#define LOBS_CCVR_CCVR_MASK (0xFFFFFFFFUL)
#define LOBS_CCVR_CCVR_SHIFT (0U)
#define LOBS_CCVR_CCVR_GET(x) (((uint32_t)(x) & LOBS_CCVR_CCVR_MASK) >> LOBS_CCVR_CCVR_SHIFT)

/* Bitfield definition for register: CAVR */
/*
 * TRACE (RO)
 *
 * Trace active.
 * 0b0 Trace is not active.
 * 0b1 Trace is active.
 */
#define LOBS_CAVR_TRACE_MASK (0x8U)
#define LOBS_CAVR_TRACE_SHIFT (3U)
#define LOBS_CAVR_TRACE_GET(x) (((uint32_t)(x) & LOBS_CAVR_TRACE_MASK) >> LOBS_CAVR_TRACE_SHIFT)

/* Bitfield definition for register: FIFOSTATE */
/*
 * FULL (RO)
 *
 * FIFO full
 */
#define LOBS_FIFOSTATE_FULL_MASK (0x2U)
#define LOBS_FIFOSTATE_FULL_SHIFT (1U)
#define LOBS_FIFOSTATE_FULL_GET(x) (((uint32_t)(x) & LOBS_FIFOSTATE_FULL_MASK) >> LOBS_FIFOSTATE_FULL_SHIFT)

/*
 * EMPTY (RO)
 *
 * FIFO empty
 */
#define LOBS_FIFOSTATE_EMPTY_MASK (0x1U)
#define LOBS_FIFOSTATE_EMPTY_SHIFT (0U)
#define LOBS_FIFOSTATE_EMPTY_GET(x) (((uint32_t)(x) & LOBS_FIFOSTATE_EMPTY_MASK) >> LOBS_FIFOSTATE_EMPTY_SHIFT)

/* Bitfield definition for register: FINALADDR */
/*
 * ADDR (RW)
 *
 * Final address
 */
#define LOBS_FINALADDR_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_FINALADDR_ADDR_SHIFT (0U)
#define LOBS_FINALADDR_ADDR_SET(x) (((uint32_t)(x) << LOBS_FINALADDR_ADDR_SHIFT) & LOBS_FINALADDR_ADDR_MASK)
#define LOBS_FINALADDR_ADDR_GET(x) (((uint32_t)(x) & LOBS_FINALADDR_ADDR_MASK) >> LOBS_FINALADDR_ADDR_SHIFT)

/* Bitfield definition for register: TRIGADDR1 */
/*
 * ADDR (RW)
 *
 * Trigger address1
 */
#define LOBS_TRIGADDR1_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_TRIGADDR1_ADDR_SHIFT (0U)
#define LOBS_TRIGADDR1_ADDR_SET(x) (((uint32_t)(x) << LOBS_TRIGADDR1_ADDR_SHIFT) & LOBS_TRIGADDR1_ADDR_MASK)
#define LOBS_TRIGADDR1_ADDR_GET(x) (((uint32_t)(x) & LOBS_TRIGADDR1_ADDR_MASK) >> LOBS_TRIGADDR1_ADDR_SHIFT)

/* Bitfield definition for register: TRIGADDR2 */
/*
 * ADDR (RW)
 *
 * Trigger address2
 */
#define LOBS_TRIGADDR2_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_TRIGADDR2_ADDR_SHIFT (0U)
#define LOBS_TRIGADDR2_ADDR_SET(x) (((uint32_t)(x) << LOBS_TRIGADDR2_ADDR_SHIFT) & LOBS_TRIGADDR2_ADDR_MASK)
#define LOBS_TRIGADDR2_ADDR_GET(x) (((uint32_t)(x) & LOBS_TRIGADDR2_ADDR_MASK) >> LOBS_TRIGADDR2_ADDR_SHIFT)

/* Bitfield definition for register: TRIGADDR3 */
/*
 * ADDR (RW)
 *
 * Trigger address3
 */
#define LOBS_TRIGADDR3_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_TRIGADDR3_ADDR_SHIFT (0U)
#define LOBS_TRIGADDR3_ADDR_SET(x) (((uint32_t)(x) << LOBS_TRIGADDR3_ADDR_SHIFT) & LOBS_TRIGADDR3_ADDR_MASK)
#define LOBS_TRIGADDR3_ADDR_GET(x) (((uint32_t)(x) & LOBS_TRIGADDR3_ADDR_MASK) >> LOBS_TRIGADDR3_ADDR_SHIFT)

