hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_lobs_regs.h
/* Bitfield definition for register: TRIGADDR4 */
/*
 * ADDR (RW)
 *
 * Trigger address4
 */
#define LOBS_TRIGADDR4_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_TRIGADDR4_ADDR_SHIFT (0U)
#define LOBS_TRIGADDR4_ADDR_SET(x) (((uint32_t)(x) << LOBS_TRIGADDR4_ADDR_SHIFT) & LOBS_TRIGADDR4_ADDR_MASK)
#define LOBS_TRIGADDR4_ADDR_GET(x) (((uint32_t)(x) & LOBS_TRIGADDR4_ADDR_MASK) >> LOBS_TRIGADDR4_ADDR_SHIFT)

/* Bitfield definition for register: GRPSELA */
/*
 * NUM2 (RW)
 *
 * Select sample group number2
 */
#define LOBS_GRPSELA_NUM2_MASK (0xF0U)
#define LOBS_GRPSELA_NUM2_SHIFT (4U)
#define LOBS_GRPSELA_NUM2_SET(x) (((uint32_t)(x) << LOBS_GRPSELA_NUM2_SHIFT) & LOBS_GRPSELA_NUM2_MASK)
#define LOBS_GRPSELA_NUM2_GET(x) (((uint32_t)(x) & LOBS_GRPSELA_NUM2_MASK) >> LOBS_GRPSELA_NUM2_SHIFT)

/*
 * NUM1 (RW)
 *
 * Select sample group number1
 */
#define LOBS_GRPSELA_NUM1_MASK (0xFU)
#define LOBS_GRPSELA_NUM1_SHIFT (0U)
#define LOBS_GRPSELA_NUM1_SET(x) (((uint32_t)(x) << LOBS_GRPSELA_NUM1_SHIFT) & LOBS_GRPSELA_NUM1_MASK)
#define LOBS_GRPSELA_NUM1_GET(x) (((uint32_t)(x) & LOBS_GRPSELA_NUM1_MASK) >> LOBS_GRPSELA_NUM1_SHIFT)

/* Bitfield definition for register: GRPENA */
/*
 * EN2 (RW)
 *
 * Enable sample group number2
 */
#define LOBS_GRPENA_EN2_MASK (0x2U)
#define LOBS_GRPENA_EN2_SHIFT (1U)
#define LOBS_GRPENA_EN2_SET(x) (((uint32_t)(x) << LOBS_GRPENA_EN2_SHIFT) & LOBS_GRPENA_EN2_MASK)
#define LOBS_GRPENA_EN2_GET(x) (((uint32_t)(x) & LOBS_GRPENA_EN2_MASK) >> LOBS_GRPENA_EN2_SHIFT)

/*
 * EN1 (RW)
 *
 * Enable sample group number1
 */
#define LOBS_GRPENA_EN1_MASK (0x1U)
#define LOBS_GRPENA_EN1_SHIFT (0U)
#define LOBS_GRPENA_EN1_SET(x) (((uint32_t)(x) << LOBS_GRPENA_EN1_SHIFT) & LOBS_GRPENA_EN1_MASK)
#define LOBS_GRPENA_EN1_GET(x) (((uint32_t)(x) & LOBS_GRPENA_EN1_MASK) >> LOBS_GRPENA_EN1_SHIFT)

/* Bitfield definition for register: SIGSELA1 */
/*
 * NUM4 (RW)
 *
 * Select sample signal bit number4 in first group
 */
#define LOBS_SIGSELA1_NUM4_MASK (0xFF000000UL)
#define LOBS_SIGSELA1_NUM4_SHIFT (24U)
#define LOBS_SIGSELA1_NUM4_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM4_SHIFT) & LOBS_SIGSELA1_NUM4_MASK)
#define LOBS_SIGSELA1_NUM4_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM4_MASK) >> LOBS_SIGSELA1_NUM4_SHIFT)

/*
 * NUM3 (RW)
 *
 * Select sample signal bit number3 in first group
 */
#define LOBS_SIGSELA1_NUM3_MASK (0xFF0000UL)
#define LOBS_SIGSELA1_NUM3_SHIFT (16U)
#define LOBS_SIGSELA1_NUM3_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM3_SHIFT) & LOBS_SIGSELA1_NUM3_MASK)
#define LOBS_SIGSELA1_NUM3_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM3_MASK) >> LOBS_SIGSELA1_NUM3_SHIFT)

/*
 * NUM2 (RW)
 *
 * Select sample signal bit number2 in first group
 */
#define LOBS_SIGSELA1_NUM2_MASK (0xFF00U)
#define LOBS_SIGSELA1_NUM2_SHIFT (8U)
#define LOBS_SIGSELA1_NUM2_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM2_SHIFT) & LOBS_SIGSELA1_NUM2_MASK)
#define LOBS_SIGSELA1_NUM2_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM2_MASK) >> LOBS_SIGSELA1_NUM2_SHIFT)

/*
 * NUM1 (RW)
 *
 * Select sample signal bit number1 in first group
 */
#define LOBS_SIGSELA1_NUM1_MASK (0xFFU)
#define LOBS_SIGSELA1_NUM1_SHIFT (0U)
#define LOBS_SIGSELA1_NUM1_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM1_SHIFT) & LOBS_SIGSELA1_NUM1_MASK)
#define LOBS_SIGSELA1_NUM1_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM1_MASK) >> LOBS_SIGSELA1_NUM1_SHIFT)

/* Bitfield definition for register: SIGSELA2 */
/*
 * NUM4 (RW)
 *
 * Select sample signal bit number4 in second group
 */
#define LOBS_SIGSELA2_NUM4_MASK (0xFF000000UL)
#define LOBS_SIGSELA2_NUM4_SHIFT (24U)
#define LOBS_SIGSELA2_NUM4_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM4_SHIFT) & LOBS_SIGSELA2_NUM4_MASK)
#define LOBS_SIGSELA2_NUM4_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM4_MASK) >> LOBS_SIGSELA2_NUM4_SHIFT)

/*
 * NUM3 (RW)
 *
 * Select sample signal bit number3 in second group
 */
#define LOBS_SIGSELA2_NUM3_MASK (0xFF0000UL)
#define LOBS_SIGSELA2_NUM3_SHIFT (16U)
#define LOBS_SIGSELA2_NUM3_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM3_SHIFT) & LOBS_SIGSELA2_NUM3_MASK)
#define LOBS_SIGSELA2_NUM3_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM3_MASK) >> LOBS_SIGSELA2_NUM3_SHIFT)

/*
 * NUM2 (RW)
 *
 * Select sample signal bit number2 in second group
 */
#define LOBS_SIGSELA2_NUM2_MASK (0xFF00U)
#define LOBS_SIGSELA2_NUM2_SHIFT (8U)
#define LOBS_SIGSELA2_NUM2_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM2_SHIFT) & LOBS_SIGSELA2_NUM2_MASK)
#define LOBS_SIGSELA2_NUM2_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM2_MASK) >> LOBS_SIGSELA2_NUM2_SHIFT)

/*
 * NUM1 (RW)
 *
 * Select sample signal bit number1 in second group
 */
#define LOBS_SIGSELA2_NUM1_MASK (0xFFU)
#define LOBS_SIGSELA2_NUM1_SHIFT (0U)
#define LOBS_SIGSELA2_NUM1_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM1_SHIFT) & LOBS_SIGSELA2_NUM1_MASK)
#define LOBS_SIGSELA2_NUM1_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM1_MASK) >> LOBS_SIGSELA2_NUM1_SHIFT)

/* Bitfield definition for register: SIGENA */
/*
 * EN2 (RW)
 *
 * Enable sample signal number2
 */
#define LOBS_SIGENA_EN2_MASK (0xF0U)
#define LOBS_SIGENA_EN2_SHIFT (4U)
#define LOBS_SIGENA_EN2_SET(x) (((uint32_t)(x) << LOBS_SIGENA_EN2_SHIFT) & LOBS_SIGENA_EN2_MASK)
#define LOBS_SIGENA_EN2_GET(x) (((uint32_t)(x) & LOBS_SIGENA_EN2_MASK) >> LOBS_SIGENA_EN2_SHIFT)

/*
 * EN1 (RW)
 *
 * Enable sample signal number1
 */
#define LOBS_SIGENA_EN1_MASK (0xFU)
#define LOBS_SIGENA_EN1_SHIFT (0U)
#define LOBS_SIGENA_EN1_SET(x) (((uint32_t)(x) << LOBS_SIGENA_EN1_SHIFT) & LOBS_SIGENA_EN1_MASK)
#define LOBS_SIGENA_EN1_GET(x) (((uint32_t)(x) & LOBS_SIGENA_EN1_MASK) >> LOBS_SIGENA_EN1_SHIFT)

/* Bitfield definition for register of struct array STATE: SIGSEL */
/*
 * EN (RW)
 *
 * Selects Signal Group.
 * 0x1 Selects Signal Group 0.
 * 0x2 Selects Signal Group 1.
 * 0x4 Selects Signal Group 2.
 * 0x8 Selects Signal Group 3.
 * 0x10 Selects Signal Group 4.
 * 0x20 Selects Signal Group 5.
 * 0x40 Selects Signal Group 6.
 * 0x80 Selects Signal Group 7.
 * 0x100 Selects Signal Group 8.
 * 0x200 Selects Signal Group 9.
 * 0x400 Selects Signal Group 10.
 * 0x800 Selects Signal Group 11.
 */
#define LOBS_STATE_SIGSEL_EN_MASK (0xFFFU)
#define LOBS_STATE_SIGSEL_EN_SHIFT (0U)
#define LOBS_STATE_SIGSEL_EN_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGSEL_EN_SHIFT) & LOBS_STATE_SIGSEL_EN_MASK)
#define LOBS_STATE_SIGSEL_EN_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGSEL_EN_MASK) >> LOBS_STATE_SIGSEL_EN_SHIFT)

